todo_project/app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "i am bad at this"], ["body", ""], ["created_at", "2019-04-23 23:37:22.031663"], ["updated_at", "2019-04-23 23:37:22.031663"]]
---
  def create
    @todo = Todo.new(todo_params)

    if @todo.save